#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <unistd.h>
#include <termios.h>

int getch();

#define ANSI_COLOR_BLACK   "\x1b[30m"
#define ANSI_COLOR_RED     "\x1b[31m"
#define ANSI_COLOR_GREEN   "\x1b[32m"
#define ANSI_COLOR_YELLOW  "\x1b[33m"
#define ANSI_COLOR_BLUE    "\x1b[34m"
#define ANSI_COLOR_MAGENTA "\x1b[35m"
#define ANSI_COLOR_CYAN    "\x1b[36m"
#define ANSI_COLOR_RESET   "\x1b[0m"

#define ANSI_BG_BLACK   "\x1b[40m"
#define ANSI_BG_RED     "\x1b[41m"
#define ANSI_BG_GREEN   "\x1b[42m"
#define ANSI_BG_YELLOW  "\x1b[43m"
#define ANSI_BG_BLUE    "\x1b[44m"
#define ANSI_BG_BAGNETA "\x1b[45m" 
#define ANSI_BG_CYAN    "\x1b[46m"
#define ANSI_BG_WHITE   "\x1b[47m"

int main(void)
{
	char map[52][220] = {
		"🔚🔙🔚🔙🔚🔙🔚🔙🔚🔙🔚🔙🔚🔙🔚🔙🔚🔙🔚🔙🔚🔙🔚🔙🔚🔙🔚🔙🔚🔙🔚🔙🔚🔙🔚🔙🔚🔙🔚🔙🔚🔙🔚🔙🔚🔙🔚🔙🔚🔙🔙",
		"🧊🧊🧊🧊🧊🧊🧊🧊🧊🧊🧊🧊🧊▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ⛄ 🗻⛄ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🔙",
		"🧊▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🥶🗻🗻▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🔙",
		"🧊▪ 🧊🧊🐧🧊🧊▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ⛷ 🗻▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🔙",
		"🧊▪ ▪ ▪ 🧊🐧🧊▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🥶🗻🗻🗻▪ ▪ ▪ ⓖ ⓐ ⓣ ⓔ ▪ ▪ ▪ ▪ 🔙",
		"🧊▪ 🧊▪ ▪ 🧊🧊▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🥶🗻🗻🗻▪ ▪ ▪ ▪ ╔  ◃▹  ╗▪ ▪ ▪ ▪ 🔙",
		"🧊▪ 🧊🐧🧊▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ⛷ 🗻▪ ▪ ▪ ▪ ▪ ▪ ▪ ║ ૯  ૭ ║▪ ▪ ▪ ▪ 🔙",
		"🧊▪ 🧊🧊🧊🧊▪  ╭ ◃▹ ╮ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ⛷ 🗻▪ ▪ 🗻🗻▪ ▪ ▪ ▪ ║ ૫  ૨ ║▪ ▪ ▪ ▪ 🔙",
		"▪ ▪ ▪ ▪ ▪ ▪ ▪  ▵ ◖◗ ▿ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🏂🗻🗻🗻🗻🗻🗻🗻▪ ▪ ▪ ╚ ╗  ╔ ╝▪ ▪ ▪ ▪ 🔙",
		"▪ ▪ ▪ ▪ ▪ ▪ ▪  ╰ ◃▹ ╯ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🔙",
		"▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪  ◢◣ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🔙",
		"▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 👾💫▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🔙",
		"▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 👻👹▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🏰🏰🏰🏰🏰🏰▪ 🏰🏰🏰🏰🏰🏰🏰🏰🏰🎪🏰▪ ▪ ▪ ▪ 🔙",
		"▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🧛🧞▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🧱🧱🧱🧱🧱🧱▪ 🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱▪ ▪ ▪ ▪ 🔙",
		"▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 👽😈▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🔥▪ 🔥🔥🔥🔥🔥▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🔙",
		"▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🧛🧞▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🔥▪ 🔥🔥🔥🔥▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🔙",
		"▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 💀😱▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🔥▪ ▪ 🔥🔥🔥▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🔙",
		"▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 👣👥▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🌋▪ 🌋▪ 🌋🌋▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🔙",
		"▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🧟🧟▪ ▪ ▪ ▪ ▪ 🗿🗿🗿🗿▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🔥▪ ▪ 🔥🔥🔥▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🔙",
		"▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🌋▪ 🌋🧗▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🔙",
		"▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🌋🌋▪ 🌋🔥▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🔙",
		"▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🌲🌳▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🔙",
		"▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🌳🌳▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🧚🦄🦄▪ ▪ ▪ ▪ ▪ 🔙",
		"▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🌲🌳▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🌈🌈🌈▪ ▪ ▪ ▪ ▪ 🔙",
		" ◢◣  ◢◣  ◢◣  ◢◣  ◢◣ 🗻▪ 🗻🗻 ◢◣  ◢◣  ◢◣  ◢◣  ◢◣ ▪ ▪ ▪ ▪ ▪ 🌲🌳🌲🌳▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🌻🟢🌺🌷🌼▪ ▪ ▪ ▪ 🔙",
		"◢  ◣◢  ◣◢  ◣◢  ◣◢ ▪ ▪ 🗻▪  ◣◢  ◣◢  ◣◢  ◣◢  ◣◢  ◣▪ ▪ ▪ ▪ ▪ 🌲🌳🌲🌳▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🌾🍄💐🌹🥀▪ ▪ ▪ ▪ 🔙",
		"▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🗻🗻🗻▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🌲🌳🌲🌳▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🍀🎍🍃▪ ▪ ▪ ▪ ▪ 🔙",
		"▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🗻🗻▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🌲🌳🌲▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🔙",
		"▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🗻🗻▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🌲🌳▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🔙",
		"▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🗻🗻▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🌲🌳▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🔙",
		"▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🗻🗻▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🌲🌳▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🔙",
		"▪ ▪ ▪ ▪ 🟧🌠▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🗻🗻▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🌲▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🔙",
		"▪ ▪ ▪ ▪ 🟧🟧▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🗻🗻▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🌳▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🔙",
		"▪ ▪ ▪ ▪ 🟧🟧🔆▪ ▪ ▪ ▪ ▪ ▪ ▪ 🗻🗻▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🌲🌳▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🔙",
		"▪ ▪ ▪ ▪ 🟧🟧🌵🕌🕌▪ ▪ ▪ ▪ ▪ 🗻🗻▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🌲🌳▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🔙",
		"▪ ▪ ▪ ▪ 🟨🟨🟨🕋🕋▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🌲🌳🐍🐢🦠🦎🐯🦁🐯▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🔙",
		"▪ ▪ ▪ ▪ 🐪🐫🟨🟨▪ 🟨🏺▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🌲🌳🌲🌳🌲🌳🌲🌳🌲🌳🌲🌳🌲🌳🌲🌳🌲🌳🌲🌳▪ ▪ ▪ 🔙",
		"▪ ▪ ▪ ▪ 🟨🟨🟨▪ 🟨🟨▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🚧🚧🚧🚧🚧🚧🚧🚧🚧▪ ▪ ▪ ▪ 🔙",
		"▪ ▪ ▪ ▪ 🟨🟨▪ 🟨🟨🟨▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🔙",
		"▪ ▪ ▪ ▪ ▪ ▪ 🟨🟨🟨🟨▪ ▪ ▪ ▪ ▪ ▪ 🌀▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🔙",
		"▪ ▪ ▪ ▪ ▪ ▪ 🦴🦴🟨🟨▪ ▪ ▪ ▪ ▪ 🌀🌀🌀▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🔯🛐🛅🛃🚭▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🔙",
		"▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🌀🌀🌀🌀🌀▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🏰🏯▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🏊🌊🦈🌊",
		"▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🌀🌀🌀▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🏫🏩💒🏥🚩▪ ▪ ▪ ▪ ▪ ▪ 🏊🌊🌊🌊",
		"▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🌀▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🚰🎦🚻🏁🚩▪ ▪ ▪ ▪ ▪ ▪ ▪ 🦑🌊🌊",
		"▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ⛵",
		"🌠🎇🎆🌠🎇🎆🌠🎇🎆🌠🎇🎆🌠▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🐳🌊🌊🌊🌊",
		"🌌🌌🌌🌌🌌🌌🌌🌌🌌🌌🌌🌌🌌▪ ▪ ▪ 🌴🌱🌿🍀🎍🎋🍃🐉🐲🦕▪ 🐲🍃🌴🌱🌿🍀🎍🎋🌴🌱🌿🍀🐍🐢▪ ▪ ▪ ▪ ▪ ▪ 🌊🌊🌊🌊",
		"⛰ ⛰ ⛰ ⛰ ⛰ ⛰ ⛰ ⛰ ⛰ ⛰ ⛰ ⛰ ⛰ ▪ ▪ ▪ 🟩🟩🟩🟩🟩🟩🟩🟩🟩▪ 🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩▪ ▪ ▪ ▪ ▪ ▪ 🦈🌊🌊",
		"▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🌊🌊",
		"▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🌊🌊",
		"▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ ▪ 🐧▪ ▪ ▪ ▪ ▪ ▪ 🧜🧜🌊🌊",
		"⛰ ⛰ ⛰ ⛰ ⛰ ⛰ ⛰ ⛰ ⛰ ⛰ ⛰ ⛰ ⛰ ⛰ ⛰ ⛰ 🗻🗻🗻🗻🗻🗻🗻🗻🗻🗻🗻🗻🗻🗻🗻🗻🗻🗻🗻🗻🌁🌁🌁🌁🌁🌁🚢🚢🚢🚢🏄🌊🌊🌊🌊",
	};

	char map_01[52][220] = {"\0", };
	char four[5] = "\0";

	char level[6][5] = {"🤺", "🏇", "♖ ", "♕ ", "♔ " };

	int x = 4;
	int y = 49; // 0부터 시작

	char move = 0;
	char arrow_list[8][5] = {"↖", "↥", "↗", "←", "↓", "→", "↙", "↘",};
	char arrow[5] = "\0";

	char cmp[5] = "▪ ";
	char temp_char[5] = "\0";
	int temp_x = x;
	int temp_y = y;

	// 출력 색 변경은 %c단위로 특수문자3Byte + 공백1Byte = char 4개. 4개씩 묶어서 %s로 색 변경 후 다른색으로  출력
	// 기준 좌표에서 3x3 범위에 해당하는 곳의 색만 눈에 띄게 변경. 중심에 캐릭터. 그외에 회색으로.

	for(;;)
	{

		for(int i = 0; i < 52; i++) // y
		{

			printf(ANSI_COLOR_YELLOW "%2d" ANSI_COLOR_RESET, i);

			for(int j = 0; j < 220;)  // x
			{
				if(i == y && j == x)
				{
					for(int k = 0; k < 4; k++)
					{
						four[k] = level[1][k];
						j++;
					}
				}
				else
				{
					for(int k = 0; k < 4; k++)
					{
						four[k] = map[i][j];
						j++;
					}
				}

				if(((y - 1) <= i && i <= (y + 1)) && ((x - 3) <= j && j <= (x + 8))) 
					printf(ANSI_COLOR_BLACK "%s" ANSI_COLOR_RESET , four);
				else
					printf("\x1b[100m" "%s" ANSI_COLOR_RESET, four);
			}
			printf("\n");

		}

		if(move != 0)
		{	
			printf("%c 로 이동하셨습니다. x=%d,y=%d,이동방향=%s", move, x, y, temp_char);
		}
		for(;;)
		{

			printf("\n이동방향을 입력하세요.\n");
			printf("q↖ w↥ e↗  ← a↓ w→ d ↙ z↘ c  >> \n");

			move = getch();

			printf("%c\n", move);

			if(move == 65 || move == 97) // a
			{
				for(int m = 0; m < 4; m++)
					temp_char[m] = map[y][x - 4 + m];

				if(strcmp(cmp, temp_char) == 0)
					x = x - 4;

				break;
			}
			else if(move == 68 || move == 100) // d
			{
				for(int m = 0; m < 4; m++)
					temp_char[m] = map[y][x + 4 + m];

				if(strcmp(cmp, temp_char) == 0)
					x = x + 4;

				break;
			}
			else if(move == 83 || move == 115) // s
			{
				for(int m = 0; m < 4; m++)
					temp_char[m] = map[y + 1][x + m];

				if(strcmp(cmp, temp_char) == 0)
					y = y + 1;

				break;
			}
			else if(move == 87 || move == 119)// w
			{
				for(int m = 0; m < 4; m++)
					temp_char[m] = map[y - 1][x + m];
				printf("%s\n", temp_char);

				if(strcmp(cmp, temp_char) == 0)
					y = y - 1;

				break;
			}
			else if(move == 81 || move == 113)// q
			{
				for(int m = 0; m < 4; m++)
					temp_char[m] = map[y - 1][x - 4 + m];
				printf("%s\n", temp_char);

				if(strcmp(cmp, temp_char) == 0)
				{
					y = y - 1;
					x = x - 4;

				}

				break;
			}
			else if(move == 69 || move == 101)// e
			{
				for(int m = 0; m < 4; m++)
					temp_char[m] = map[y - 1][x + 4 + m];
				printf("%s\n", temp_char);

				if(strcmp(cmp, temp_char) == 0)
				{
					y = y - 1;
					x = x + 4;
				}

				break;
			}
			else if(move == 90 || move == 122)// z
			{
				for(int m = 0; m < 4; m++)
					temp_char[m] = map[y + 1][x - 4 + m];
				printf("%s\n", temp_char);

				if(strcmp(cmp, temp_char) == 0)
				{
					y = y + 1;
					x = x - 4;
				}

				break;
			}
			else if(move == 67 || move == 99)// c
			{
				for(int m = 0; m < 4; m++)
					temp_char[m] = map[y + 1][x + 4 + m];
				printf("%s\n", temp_char);

				if(strcmp(cmp, temp_char) == 0)
				{
					y = y + 1;
					x = x + 4;
				}

				break;
			}
			else
			{
				printf("이동할 수 없는 지역입니다.\n다시 입력해주세요");
				break;
			}

		}

		if(move != 0)
			printf("%c 로 이동하셨습니다.\n", move);


	system("clear");
	}




}

int getch()
{
    int c;
    struct termios oldattr, newattr;

    tcgetattr(STDIN_FILENO, &oldattr);           // 현재 터미널 설정 읽음
    newattr = oldattr;
    newattr.c_lflag &= ~(ICANON | ECHO);         // CANONICAL과 ECHO 끔
    newattr.c_cc[VMIN] = 1;                      // 최소 입력 문자 수를 1로 설정
    newattr.c_cc[VTIME] = 0;                     // 최소 읽기 대기 시간을 0으로 설정
    tcsetattr(STDIN_FILENO, TCSANOW, &newattr);  // 터미널에 설정 입력
    c = getchar();                               // 키보드 입력 읽음
    tcsetattr(STDIN_FILENO, TCSANOW, &oldattr);  // 원래의 설정으로 복구
    return c;
}

